{
  "success": {
    "type": "success",
    "content": "The operation was successful."
  },
  "alreadyjoined": {
    "type": "warning",
    "content": "You already joined this lobby."
  },
  "roomfull": {
    "type": "error",
    "content": "You cannot join this lobby. The lobby is full."
  },
  "notowner": {
    "type": "warning",
    "content": "You cannot change lobby settings. You are not the lobby owner."
  },
  "notownerstart": {
    "type": "warning",
    "content": "You cannot start the game. You are not the lobby owner."
  },
  "alreadyjoinedspectator": {
    "type": "warning",
    "content": "You are already spectator in this lobby."
  },
  "nospectator": {
    "type": "error",
    "content": "You cannot join this lobby as spectator. This lobby does not allow spectators to join."
  },
  "roomclosedspectator": {
    "type": "warning",
    "content": "The room was closed because no non-spectator were left."
  },
  "notartist": {
    "type": "warning",
    "content": "You cannot draw on the canvas. You are currently not the artist."
  },
  "login": {
    "type": "success",
    "content": "Welcome back! Your drawings will be saved to your art gallery. Enjoy your stay!"
  },
  "login2": {
    "type": "success",
    "content": "Welcome back!"
  },
  "wronglogin": {
    "type": "error",
    "content": "This username is already claimed. Try a different username or check your password."
  },
  "wronglogin2": {
    "type": "error",
    "content": "The provied password is wrong. Please check your login details."
  },
  "registerd": {
    "type": "success",
    "content": "Welcome to your newly claimed account! Your drawings will be saved to your art gallery. Enjoy your stay!"
  },
  "notregistered": {
    "type": "warning",
    "content": "This username is not claimed! You can claim this username by providing a password. Only registered users can view their art gallery. Enjoy your stay!"
  },
  "nouser": {
    "type": "error",
    "content": "The provided username is not registered. Please check your login details."
  },
  "unknownerror": {
    "type": "error",
    "content": "An unexpected error has accured. Please refresh the page!"
  }
}
